using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace dick
{
    public static class TextManager
    {
        // шутки по достижению длины члена
        public static string Joke(int dick)
        {
            return dick switch
            {
                30 => "З таким розміром ваш пеніс може конкурувати з пенісом африканського <s>слона</s> негра! 🐘😄",
                50 => "Ви не думали про те, що ваші стандартні боксери просто не мають достатньо місця для таких \"надбудов\" - " +
                        "тепер вам потрібні зразу дві пари, аби відчувати себе комфортно! 🩲🍆😄",
                100 => "З таким пенісом ви вже можете вважати себе справжнім змієм-чарівником! Ваш член завжди оголений, адже він здатний на ефектну виставу! 🐍🎩😄 ",
                200 => "Така піська дає можливість поїхати у власний концертний тур! " +
                        "І, звичайно, не забудьте про \"спеціальний\" мікрофон - щоб усі охочі могли " +
                        "висловити свої побажання у перервах між піснями! " +
                        "Той самий мікрофон, який тримається однією рукою і завжди готовий до \"гучних\" виступів! 🎤🎶😄",
                300 => "Ви вже не головний у своєму домі - ваш член займає лідерську позицію і вимагає власної уваги та поваги!",
                400 => "Вибачте, але з таким пенісом ви вже не просто ходите - ви майже крокуєте як величезна мандрівна ковбаса! 🌭🚶‍♂️",
                500 => "Ваша спальня це студія для зйомок порно - адже з таким розміром ви давно переплюнули не тільки лисого з браззерс а й синього кита! 🎬🍆😄",
                _ => "",
            };
        }

        // шутки по достижению диаметра ануса
        public static string AnusJoke(int anus)
        {
            return anus switch
            {
                7 => "Чому анус і шар для більярду схожі? Бо вони обидва можуть бути використані для гри, але не завжди знаходять своє місце з першого разу!",
                25 => "Чому баскетбольний м'яч - це поганий вибір для гри в анус-баскетбол? Бо, здається, у нашої команди занадто великий ентузіазм щодо розміру дірки!",
                50 => "Чому встановлення автомобільної шини у анусі - погана ідея? Бо це тільки підіймає питання: Що на світі пішло не так, щоб це сталося?",
                100 => "Чому ви власник Disneyland не погодилися встановити в анусі ще й батут? " +
                "Бо вважаєте, що ваш анальний Disneyland вже є найвищим рівнем розваг - каруселі, атракціони і піратські пригоди, а тепер і батутування?...",
                150 => "Ваш анус - це вже справжній притулок для тварин та безхатьок. Там у них завжди тепло і затишно. -_-",
                200 => "Так ось чому слон завжди весело проводить час у вашому анусі - " +
                "він завжди каже: 'Хочете побачити, як я стаю справжнім таємним пасажиром? Вимикаю світло!'",
                250 => "Чому власник КамАЗа вирішив ввести його в свій анус? " +
                "Бо він почув, що це найбільш ефективний спосіб очищення транспортного засобу від іржі. " +
                "Але, здається, цей експеримент виявився більш незручним, ніж він очікував",
                _ => "",
            };
        }

        // статусы для члена
        public static string Status(int dick)
        {
            if (dick >= 500)
            {
                return "Головний актор порно";
            }
            else if (dick >= 400)
            {
                return "Мандрівна ковбаса ♂️";
            }
            else if (dick >= 300)
            {
                return "Члено-домінант";
            }
            else if (dick >= 200)
            {
                return "Великий \"мікрофон\"";
            }
            else if (dick >= 100)
            {
                return "Приручатель змій";
            }
            else if (dick >= 50)
            {
                return "Пісюнковий забудовник";
            }
            else if (dick >= 30)
            {
                return "Чорний піструн";
            }
            return "Новачок-пісюнчок";
        }

        // статусы для ануса
        public static string AnusStatus(int anus)
        {
            if (anus >= 250)
            {
                return "Роботяга на КАМАЗі";
            }
            else if (anus >= 200)
            {
                return "Дослідник Африки";
            }
            else if (anus >= 150)
            {
                return "Затятий лісничий";
            }
            else if (anus >= 100)
            {
                return "Власник діснею";
            }
            else if (anus >= 50)
            {
                return "Анальний дальнобійник";
            }
            else if (anus >= 25)
            {
                return "Ветеран баскетболу";
            }
            else if (anus >= 7)
            {
                return "Майстер більярду";
            }
            return "Незайманий анус";
        }

    }
}
